#!/usr/bin/env python
# -*- coding: utf-8 -*-

import sqlite3
import datetime

def create_deck(dbpath):
    with sqlite3.connect(dbpath) as c:
        q = """CREATE TABLE deck(
        id INTEGER PRIMARY KEY,
        num TEXT,
        sym TEXT);
        """
        c.execute(q)

def create_taskperday(dbpath):
    with sqlite3.connect(dbpath) as c:
        q = """CREATE TABLE taskperday(
        mod_id TEXT PRIMARY KEY,
        day INT,
        new INT,
        total INT);
        """
        c.execute(q)

def create_qa(dbpath):
    with sqlite3.connect(dbpath) as c:
        q = """CREATE TABLE qa(
        mod_id TEXT PRIMARY KEY,
        auto_eval INT,
        answer_index INT,
        question TEXT);
        """
        c.execute(q)

def add_deck_record(i):
    with sqlite3.connect(dbpath) as c:
        db_form = [None] + i
        q = f"INSERT INTO deck VALUES(?, ?, ?)"
        c.execute(q, db_form)

def add_deck_records(cards):
    for i in cards:
        add_deck_record(i)

if __name__ == '__main__':
    current_date = datetime.date.today().toordinal()
    l = [
        ("asd.db", 
         [['1', 'H'], ['2', 'He'], ['3', 'Li'], ['4', 'Be'], ['5', 'B'], ['6', 'C'], ['7', 'N'], ['8', 'O'], ['9', 'F'], ['10', 'Ne'], ['11', 'Na'], ['12', 'Mg'], ['13', 'Al'], ['14', 'Si'], ['15', 'P'], ['16', 'S'], ['17', 'Cl'], ['18', 'Ar'], ['19', 'K'], ['20', 'Ca'], ['21', 'Sc'], ['22', 'Ti'], ['23', 'V'], ['24', 'Cr'], ['25', 'Mn'], ['26', 'Fe'], ['27', 'Co'], ['28', 'Ni'], ['29', 'Cu'], ['30', 'Zn'], ['31', 'Ga'], ['32', 'Ge'], ['33', 'As'], ['34', 'Se'], ['35', 'Br'], ['36', 'Kr']]),
    
        ("asd2.db",
         [['Россия', 'Москва'], ['Украина', 'Киев'], ['Чехия', 'Прага'], ['Словакия', 'Братислава'], ['Австрия', 'Вена'], ['Венгрия', 'Будапешт'], ['Англия', 'Лондон'], ['Уэльс', 'Кардифф'], ['Шотландия', 'Эдинбург'], ['Северная Ирландия', 'Белфаст'], ['Республика Ирландия', 'Дублин'], ['Бельгия', 'Брюссель'], ['Германия', 'Берлин'], ['Лихтенштейн', 'Вадуц'], ['Люксембург', 'Люксембург'], ['Монако', 'Монако'], ['Нидерланды', 'Амстердам'], ['Франция', 'Париж'], ['Швейцария', 'Берн'], ['Беларусь', 'Минск'], ['Болгария', 'София'], ['Молдова', 'Кишинёв'], ['Польша', 'Варшава'], ['Румыния', 'Бухарест'], ['Дания', 'Копенгаген'], ['Исландия', 'Рейкьявик'], ['Латвия', 'Рига'], ['Литва', 'Вильнюс'], ['Эстония', 'Таллин'], ['Норвегия', 'Осло'], ['Финляндия', 'Хельсинки'], ['Швеция', 'Стокгольм'], ['Албания', 'Тирана'], ['Андора', 'Андора-ла-Велья'], ['Босния и Герцеговина', 'Сараево'], ['Ватикан', 'Ватикан'], ['Греция', 'Афины'], ['Испания', 'Мадрид'], ['Италия', 'Рим'], ['Северная Македония', 'Скопье'], ['Мальта', 'Валлетта'], ['Португалия', 'Лиссабон'], ['Сан-Марино', 'Сан-Марино'], ['Косово', 'Приштина'], ['Сербия', 'Белград'], ['Словения', 'Любляна'], ['Хорватия', 'Загреб'], ['Азербайджан', 'Баку'], ['Армения', 'Ереван'], ['Грузия', 'Тбилиси'], ['Казахстан', 'Астана'], ['Кыргызстан', 'Бишкек'], ['Таджикистан', 'Душанбе'], ['Туркменистан', 'Ашхабад'], ['Узбекистан', 'Ташкент'], ['Австралия', 'Камберра'], ['Канада', 'Оттава']]),

        ("asd3.db",
         [['1', 'Январь'], ['2', 'Февраль'], ['3', 'Март'], ['4', 'Апрель'], ['5', 'Май'], ['6', 'Июнь'], ['7', 'Июль'], ['8', 'Август'], ['9', 'Сентябрь'], ['10', 'Октябрь'], ['11', 'Ноябрь'], ['12', 'Декабрь']])
    
    ]
    
    for dbpath, cards in l:
        create_deck(dbpath)
        create_taskperday(dbpath)
        create_qa(dbpath)
        add_deck_records(cards)
    
    


















