#!/usr/bin/env python
# -*- coding: utf-8 -*-

import sqlite3
import datetime

def create_deck(dbpath, n):
    with sqlite3.connect(dbpath) as c:
        s = ''
        count = 0
        for i in range(n):
            s += f'column_{count} TEXT,\n'
            count += 1
        s = s[:-2]
        q = f"CREATE TABLE deck(\nid INTEGER PRIMARY KEY,\n{s});"
        c.execute(q)

def create_taskperday(dbpath):
    with sqlite3.connect(dbpath) as c:
        q = """CREATE TABLE taskperday(
        mod_id TEXT PRIMARY KEY,
        day INT,
        new INT,
        total INT);
        """
        c.execute(q)

def create_qa(dbpath):
    with sqlite3.connect(dbpath) as c:
        q = """CREATE TABLE qa(
        mod_id TEXT PRIMARY KEY,
        auto_eval INT,
        answer_index INT,
        question TEXT);
        """
        c.execute(q)

def add_deck_record(i):
    with sqlite3.connect(dbpath) as c:
        db_form = [None] + i
        count = len(db_form)
        string = ', '.join(['?'] * count)
        q = f"INSERT INTO deck VALUES({string})"
        c.execute(q, db_form)

def add_deck_records(cards):
    for i in cards:
        add_deck_record(i)

if __name__ == '__main__':
    current_date = datetime.date.today().toordinal()
    l = [
        ("asd.db", 
         [['1', 'H', 'Водород'], ['2', 'He', 'Гелий'], ['3', 'Li', 'Литий'], ['4', 'Be', 'Бериллий'], ['5', 'B', 'Бор'], ['6', 'C', 'Углерод'], ['7', 'N', 'Азот'], ['8', 'O', 'Кислород'], ['9', 'F', 'Фтор'], ['10', 'Ne', 'Неон'], ['11', 'Na', 'Натрий'], ['12', 'Mg', 'Магний'], ['13', 'Al', 'Алюминий'], ['14', 'Si', 'Кремний'], ['15', 'P', 'Фосфор'], ['16', 'S', 'Сера'], ['17', 'Cl', 'Хлор'], ['18', 'Ar', 'Аргон'], ['19', 'K', 'Калий'], ['20', 'Ca', 'Кальций'], ['21', 'Sc', 'Скандий'], ['22', 'Ti', 'Титан'], ['23', 'V', 'Ванадий'], ['24', 'Cr', 'Хром'], ['25', 'Mn', 'Марганец'], ['26', 'Fe', 'Железо'], ['27', 'Co', 'Кобальт'], ['28', 'Ni', 'Никель'], ['29', 'Cu', 'Медь'], ['30', 'Zn', 'Цинк'], ['31', 'Ga', 'Галлий'], ['32', 'Ge', 'Германий'], ['33', 'As', 'Мышьяк'], ['34', 'Se', 'Селен'], ['35', 'Br', 'Бром'], ['36', 'Kr', 'Криптон']]),
    
        ("asd2.db",
         [['Россия', 'Москва'], ['Украина', 'Киев'], ['Чехия', 'Прага'], ['Словакия', 'Братислава'], ['Австрия', 'Вена'], ['Венгрия', 'Будапешт'], ['Англия', 'Лондон'], ['Уэльс', 'Кардифф'], ['Шотландия', 'Эдинбург'], ['Северная Ирландия', 'Белфаст'], ['Республика Ирландия', 'Дублин'], ['Бельгия', 'Брюссель'], ['Германия', 'Берлин'], ['Лихтенштейн', 'Вадуц'], ['Люксембург', 'Люксембург'], ['Монако', 'Монако'], ['Нидерланды', 'Амстердам'], ['Франция', 'Париж'], ['Швейцария', 'Берн'], ['Беларусь', 'Минск'], ['Болгария', 'София'], ['Молдова', 'Кишинёв'], ['Польша', 'Варшава'], ['Румыния', 'Бухарест'], ['Дания', 'Копенгаген'], ['Исландия', 'Рейкьявик'], ['Латвия', 'Рига'], ['Литва', 'Вильнюс'], ['Эстония', 'Таллин'], ['Норвегия', 'Осло'], ['Финляндия', 'Хельсинки'], ['Швеция', 'Стокгольм'], ['Албания', 'Тирана'], ['Андора', 'Андора-ла-Велья'], ['Босния и Герцеговина', 'Сараево'], ['Ватикан', 'Ватикан'], ['Греция', 'Афины'], ['Испания', 'Мадрид'], ['Италия', 'Рим'], ['Северная Македония', 'Скопье'], ['Мальта', 'Валлетта'], ['Португалия', 'Лиссабон'], ['Сан-Марино', 'Сан-Марино'], ['Косово', 'Приштина'], ['Сербия', 'Белград'], ['Словения', 'Любляна'], ['Хорватия', 'Загреб'], ['Азербайджан', 'Баку'], ['Армения', 'Ереван'], ['Грузия', 'Тбилиси'], ['Казахстан', 'Астана'], ['Кыргызстан', 'Бишкек'], ['Таджикистан', 'Душанбе'], ['Туркменистан', 'Ашхабад'], ['Узбекистан', 'Ташкент'], ['Австралия', 'Камберра'], ['Канада', 'Оттава']]),

        ("asd3.db",
         [['1', 'Январь', '31'], ['2', 'Февраль', '28'], ['3', 'Март', '31'], ['4', 'Апрель', '30'], ['5', 'Май', '31'], ['6', 'Июнь', '30'], ['7', 'Июль', '31'], ['8', 'Август', '31'], ['9', 'Сентябрь', '30'], ['10', 'Октябрь', '31'], ['11', 'Ноябрь', '30'], ['12', 'Декабрь', '31']])
    
    ]
    
    for dbpath, cards in l:
        n = len(cards[0])
        create_deck(dbpath, n)
        create_taskperday(dbpath)
        create_qa(dbpath)
        add_deck_records(cards)
    
    


















